using System;

namespace Lab4
{
    class Menu
    {
        public static void Main(string[] args)
        {
            string FILE; // для збереження імя файла з яким потрібно працювати
            if (args.Length != 1) // якщо передали більше одного, або жодного файла, працює з стандартними іменами файлів
            {
                FILE = null;
            }
            else // інакше працює з іншим файлом
            {
                FILE = args[0];
            }

            char task; // для збереження натиснутої клавіші
            do
            {
                Console.WriteLine("Виберіть завдання для запуску:\n");

                Console.WriteLine("[1] --- Завдання 1");
                Console.WriteLine("[2] --- Завдання 2");
                Console.WriteLine("[3] --- Завдання 3");
                Console.WriteLine("[4] --- FAQ");

                Console.WriteLine("\n[ESC] --- Вихід\n");

                Console.Write(">");
                task = Console.ReadKey(true).KeyChar; // присвоєння натиснутої клавіші
                Console.Clear(); // очистка консолі
                switch (task)
                {
                    case (char)ConsoleKey.Escape: // якщо нажали ESC виходить з програми
                        break;

                    case '1': // якщо нажали 1 запускає перше завдання, та по завершенню його роботи очищає консоль
                        Lab4_1.Program(FILE);
                        Console.Clear();
                        break;

                    case '2': // якщо нажали 2 -||-
                        Lab4_2.Program(FILE);
                        Console.Clear();
                        break;

                    case '3': // якщо нажали 3 -||-
                        Lab4_3.Program(FILE);
                        Console.Clear();
                        break;

                    case '4': // якщо нажали 4, відкриється меню зі списком завданнь до лабораторної
                        FAQ();
                        break;

                    default:
                        Console.Clear();
                        Console.WriteLine("\nПомилка: Такого пункта немає\n\n");
                        break;
                }
            } while (task != (char)ConsoleKey.Escape); // якщо нажали ESC виходить з програми
        }

        private static void FAQ()
        {
            Console.WriteLine("\nТут можна прочитати яка була умова для кожного завдання");
            char task;
            do
            {
                Console.WriteLine("\nВиберіть до якого завдання хочете прочитати умову:\n");
                Console.WriteLine("[1] --- Завдання 1");
                Console.WriteLine("[2] --- Завдання 2");
                Console.WriteLine("[3] --- Завдання 3");

                Console.WriteLine("\n[ESC] --- Вихід\n");
                Console.Write("FAQ~> ");
                task = Console.ReadKey(true).KeyChar;
                Console.Write("\n\t--------------------------------------------------------------------------------------------------------\n");

                switch (task)
                {
                    case (char)ConsoleKey.Escape:
                        break;

                    case '1':
                        Console.WriteLine("\n" +
                            "1. Створити клас та розробити консольний застосунок, який реалізує вказані дії.\n" +
                            "Також розробити модульний тест для перевірки коректності роботи методу.\n" +
                            "Спільне для всіх варіантів.");

                        Console.WriteLine("\n" +
                            "Розробити консольний застосунок для роботи з класом Student з полями: name, LastName,\n" +
                            "Group, Year, Adress, Passport, Age, Telephon, Rating.Під рейтингом розуміється середній бал за\n" +
                            "100 - ою системою.Всі поля класу зробити закритими, а доступ до них реалізувати через get i set.\n" +
                            "Реалізувати конструктор без параметрів, а ініціалізацію полів виконати через властивості.\n" +
                            "Реалізувати метод StudentRating(int R).Метод повинен виводити відповідне текстове повідомлення,\n" +
                            "в залежності від рейтингу: якщо рейтинг 90 і вище - повідомлення «Вітаємо відмінника», для рейтингу від\n" +
                            "75 балів – «можна вчитися краще», для рейтингу менше 75 балів – «Варто більше уваги приділяти навчанню»\n");
                        break;

                    case '2':
                        Console.WriteLine("\n" +
                            "2. Розробити консольний застосунок для роботи з класом згідно свого варіанту.\n" +
                            "Створити не менше 10 записів для виконання операцій, вказаних у завданні.\n" +
                            "Для ідентифікації спроби введення з клавіатури некоректних даних описати виключення.");

                        Console.WriteLine("\n" +
                            "13. Описати клас для бази зданих з інформацією про метеорологічні спостереження протягом місяця\n" +
                            "у форматі: дата, температура, атмосферний тиск.Впорядкувати дані у порядку зростання тиску та\n" +
                            "вивести результати на екран у формі таблиці. Визначити два дні з найбільшим перепадом тиску.");
                        break;

                    case '3':
                        Console.WriteLine("\n" +
                            "3. Розробити консольний застосунок для роботи з базою даних, що зберігається у\n" +
                            "текстовому файлі(початковий масив не менше 10 записів).Структура бази даних\n" +
                            "описується класом згідно вашого варіанта.Передбачити роботу з довільною кількістю\n" +
                            "записів.Для ідентифікації спроби введення з клавіатури некоректних даних описати\n" +
                            "виключення.Всі поля класу зробити закритими, а доступ до них реалізувати через get i set.\n" +
                            "Реалізувати конструктори з параметрами та без параметрів, а ініціалізацію полів виконати\n" +
                            "через властивості.Реалізувати методи для:\n" +
                            "\t\t\t– додавання записів;\n" +
                            "\t\t\t– редагування записів;\n" +
                            "\t\t\t– знищення записів;\n" +
                            "\t\t\t– виведення інформації з файла на екран;\n" +
                            "\t\t\t– пошук потрібної інформації за конкретною ознакою(поле Параметр пошуку);\n" +
                            "\t\t\t– сортування за різними полями(поле Параметр сортування).\n\n" +
                            "Меню програми реалізувати по натисненню на певні клавіші: наприклад, Enter – вихід,\n" +
                            "п - пошук, р – редагування тощо");

                        Console.WriteLine("\n" +
                            "Варіант 13\n" +
                            "Клас: Склад товарів\n" +
                            "Поля: Інвентарний номер, назва товару, вага, ціна, кількість\n" +
                            "Параметр сортування: Вага\n" +
                            "Параметр пошуку: Назва товару");
                        break;

                    default: Console.WriteLine("\nПомилка: Такого пункта немає\n\n"); break;
                }
            } while (task != (char)ConsoleKey.Escape);  // якщо нажали ESC виходить з програми
            Console.Clear();
        }
    }
}
